"use client";

import { ClipIcon, SendIcon } from "@/shared/icons";
import { useState } from "react";

const messages = [
    {
        id: 1,
        author: "me",
        text: "Привіт! Як справи?",
        time: "14:32",
    },
    {
        id: 2,
        author: "other",
        text: "Привіт! Все добре, працюю над проєктом. А ти?",
        time: "14:33",
    },
    {
        id: 3,
        author: "me",
        text: "Та теж нормально 😅 Що саме робиш?",
        time: "14:34",
    },
    {
        id: 4,
        author: "other",
        text: "Верстаю інтерфейс для месенджера, тестую стилі повідомлень.",
        time: "14:35",
    },
    {
        id: 5,
        author: "me",
        text: "О, круто! Можу допомогти протестити.",
        time: "14:36",
    },
    {
        id: 6,
        author: "other",
        text: "Привіт! Все добре, працюю над проєктом. А ти?",
        time: "14:33",
    },
    {
        id: 7,
        author: "me",
        text: "Та теж нормально 😅 Що саме робиш?",
        time: "14:34",
    },
    {
        id: 8,
        author: "other",
        text: "Верстаю інтерфейс для месенджера, тестую стилі повідомлень.",
        time: "14:35",
    },
    {
        id: 9,
        author: "me",
        text: "О, круто! Можу допомогти протестити.О, круто! Можу допомогти протестити.О, круто! Можу допомогти протестити.О, круто! Можу допомогти протестити.О, круто! Можу допомогти протестити.О, круто! Можу допомогти протестити.О, круто! Можу допомогти протестити.О, круто! Можу допомогти протестити.О, круто! Можу допомогти протестити.О, круто! Можу допомогти протестити.О, круто! Можу допомогти протестити.О, круто! Можу допомогти протестити.О, круто! Можу допомогти протестити.О, круто! Можу допомогти протестити.О, круто! Можу допомогти протестити.О, круто! Можу допомогти протестити.О, круто! Можу допомогти протестити.О, круто! Можу допомогти протестити.О, круто! Можу допомогти протестити.О, круто! Можу допомогти протестити.О, круто! Можу допомогти протестити.О, круто! Можу допомогти протестити.",
        time: "14:36",
    },
    {
        id: 10,
        author: "me",
        text: "Привіт! Як справи?",
        time: "14:32",
    },
    {
        id: 11,
        author: "other",
        text: "Привіт! Все добре, працюю над проєктом. А ти?",
        time: "14:33",
    },
    {
        id: 12,
        author: "me",
        text: "Та теж нормально 😅 Що саме робиш?",
        time: "14:34",
    },
    {
        id: 13,
        author: "other",
        text: "Верстаю інтерфейс для месенджера, тестую стилі повідомлень.",
        time: "14:35",
    },
    {
        id: 14,
        author: "me",
        text: "О, круто! Можу допомогти протестити.",
        time: "14:36",
    },
    {
        id: 15,
        author: "other",
        text: "Привіт! Все добре, працюю над проєктом. А ти?",
        time: "14:33",
    },
    {
        id: 16,
        author: "me",
        text: "Та теж нормально 😅 Що саме робиш?",
        time: "14:34",
    },
    {
        id: 17,
        author: "other",
        text: "Верстаю інтерфейс для месенджера, тестую стилі повідомлень.",
        time: "14:35",
    },
    {
        id: 18,
        author: "me",
        text: "О, круто! Можу допомогти протестити.О, круто! Можу допомогти протестити.О, круто! Можу допомогти протестити.О, круто! Можу допомогти протестити.О, круто! Можу допомогти протестити.О, круто! Можу допомогти протестити.О, круто! Можу допомогти протестити.О, круто! Можу допомогти протестити.О, круто! Можу допомогти протестити.О, круто! Можу допомогти протестити.О, круто! Можу допомогти протестити.О, круто! Можу допомогти протестити.О, круто! Можу допомогти протестити.О, круто! Можу допомогти протестити.О, круто! Можу допомогти протестити.О, круто! Можу допомогти протестити.О, круто! Можу допомогти протестити.О, круто! Можу допомогти протестити.О, круто! Можу допомогти протестити.О, круто! Можу допомогти протестити.О, круто! Можу допомогти протестити.О, круто! Можу допомогти протестити.",
        time: "14:36",
    },
    {
        id: 19,
        author: "me",
        text: "Привіт! Як справи?",
        time: "14:32",
    },
    {
        id: 20,
        author: "other",
        text: "Привіт! Все добре, працюю над проєктом. А ти?",
        time: "14:33",
    },
    {
        id: 21,
        author: "me",
        text: "Та теж нормально 😅 Що саме робиш?",
        time: "14:34",
    },
    {
        id: 22,
        author: "other",
        text: "Верстаю інтерфейс для месенджера, тестую стилі повідомлень.",
        time: "14:35",
    },
    {
        id: 23,
        author: "me",
        text: "О, круто! Можу допомогти протестити.",
        time: "14:36",
    },
    {
        id: 24,
        author: "other",
        text: "Привіт! Все добре, працюю над проєктом. А ти?",
        time: "14:33",
    },
    {
        id: 25,
        author: "me",
        text: "Та теж нормально 😅 Що саме робиш?",
        time: "14:34",
    },
    {
        id: 26,
        author: "other",
        text: "Верстаю інтерфейс для месенджера, тестую стилі повідомлень.",
        time: "14:35",
    },
    {
        id: 27,
        author: "me",
        text: "О, круто! Можу допомогти протестити.О, круто! Можу допомогти протестити.О, круто! Можу допомогти протестити.О, круто! Можу допомогти протестити.О, круто! Можу допомогти протестити.О, круто! Можу допомогти протестити.О, круто! Можу допомогти протестити.О, круто! Можу допомогти протестити.О, круто! Можу допомогти протестити.О, круто! Можу допомогти протестити.О, круто! Можу допомогти протестити.О, круто! Можу допомогти протестити.О, круто! Можу допомогти протестити.О, круто! Можу допомогти протестити.О, круто! Можу допомогти протестити.О, круто! Можу допомогти протестити.О, круто! Можу допомогти протестити.О, круто! Можу допомогти протестити.О, круто! Можу допомогти протестити.О, круто! Можу допомогти протестити.О, круто! Можу допомогти протестити.О, круто! Можу допомогти протестити.",
        time: "14:36",
    },
];

function ChatSlug() {
    const [inputValue, setInputValue] = useState<string>("");

    const handleSend = () => {
        if (!inputValue.trim()) return;
        console.log("Відправлено:", inputValue);
        setInputValue("");
    };

    return (
        <div className="flex flex-col h-full bg-neutral-800">
            <div className="flex flex-col gap-[10px] px-[20%] py-[20px] overflow-y-auto flex-1 mt-[70px]">
                {messages.map((msg) => (
                    <div
                        key={msg.id}
                        className={`flex gap-[5px] max-w-[70%] px-[15px] py-[7px] rounded-2xl text-sm relative ${
                            msg.author === "me"
                                ? "ml-auto bg-neutral-900 text-white rounded-br-none"
                                : "mr-auto bg-neutral-700/50 text-white rounded-bl-none"
                        }`}
                    >
                        <div>{msg.text}</div>
                        <div className="text-xs text-neutral-400 self-end">
                            {msg.time}
                        </div>
                    </div>
                ))}
            </div>

            <div className="w-full flex gap-[10px] justify-between px-[20%] py-[15px] border-t border-neutral-700">
                <button className="p-[15px] rounded-full bg-neutral-950 border border-neutral-800 hover:bg-neutral-500 transition">
                    <ClipIcon className="w-[23px] h-[23px] fill-white" />
                </button>
                <input
                    type="text"
                    value={inputValue}
                    onChange={(e) => setInputValue(e.target.value)}
                    placeholder="Write your message..."
                    className="outline-0 p-[10px] px-[20px] rounded-xl bg-transparent w-full text-white border border-neutral-700 group focus-within:border-neutral-400 transition-all duration-300 flex gap-2 items-center "
                />
                <button
                    onClick={handleSend}
                    className="p-[15px] rounded-full bg-neutral-950 border border-neutral-800 hover:bg-neutral-500 transition"
                >
                    <SendIcon className="w-[25px] h-[25px] fill-none stroke-2 stroke-white" />
                </button>
            </div>
        </div>
    );
}

export default ChatSlug;
